Repository: nacyot/omegat-gist
Catalog: omegat-gist-level2.tmx
Source language: ja
Languages: ko

source: # Docker Cheat Sheet
ko: # Docker 치트 시트

source: ## Containers
ko: ## 컨테이너

source: ## Exposing ports
ko: ## 포트 노출하기

source: ## Images
ko: ## Docker 이미지

source: ## Installation
ko: ## 설치

source: ## Layers
ko: ## 레이어

source: ## Links
ko: ## 링크

source: ## Prequisites
ko: ## 필요한 것들

source: ## Registry & Repository
ko: ## 레지스트리(Registry) & 저장소(Repository)

source: ## TL;DR, I just want a dev environment
ko: ## TL;DR, 지금 바로 Docker 개발 환경 구축하기

source: ## Tips
ko: ## 팁

source: ## Volumes
ko: ## 볼륨

source: ## Why
ko: ## 왜 Docker를 사용해야하는가?

source: ### Commit with command (needs Dockerfile)
ko: ### 명령어와 함께 커밋하기

source: ### Delete old containers
ko: ### 오래된 컨테이너들 삭제하기

source: ### Delete stopped containers
ko: ### 멈춰있는 컨테이너들 삭제하기

source: ### Get Environment Settings
ko: ### 이미지의 환경 변수 읽어오기

source: ### Get IP address
ko: ### IP address 정보

source: ### Info
ko: ### 관련된 정보를 출력해주는 명령어

source: ### Last Ids
ko: ### 마지막에 실행된 컨테이너의 ID

source: ### Lifecycle
ko: ### 라이프 사이클

source: ### Show image dependencies
ko: ### 이미지의 의존관계 이미지로 출력하기

source: (kind of odd, you'd think images would be immutable after create) * [`docker load`](http://docs.docker.io/en/latest/commandline/cli/#load) loads an image from a tar archive as STDIN, including images and tags (as of 0.7).
ko: * [`docker load`](http://docs.docker.io/en/latest/commandline/cli/#load) 표준 입력으로 tar 파일에서 (이미지와 태그를 포함한) 이미지를 불러온다.(0.7부터 사용가능).

source: * [A Docker Dev Environment in 24 Hours!](http://blog.relateiq.com/a-docker-dev-environment-in-24-hours-part-2-of-2/) * [Building a Development Environment With Docker](http://tersesystems.com/2013/11/20/building-a-development-environment-with-docker/) * [Discourse in a Docker Container](http://samsaffron.com/archive/2013/11/07/discourse-in-a-docker-container)
ko: * [24시간 동안 Docker 개발 한경 구축하기(A Docker Dev Environment in 24 Hours!)](http://blog.relateiq.com/a-docker-dev-environment-in-24-hours-part-2-of-2/) * [(Docker와 함께 개발환경 구축하기)Building a Development Environment With Docker](http://tersesystems.com/2013/11/20/building-a-development-environment-with-docker/) * [Docker 컨테이너에 대한 이야기(Discourse in a Docker Container)](http://samsaffron.com/archive/2013/11/07/discourse-in-a-docker-container)

source: * [`docker attach`](http://docs.docker.io/en/latest/commandline/cli/#attach) will connect to a running container.
ko: * [`docker attach`](http://docs.docker.io/en/latest/commandline/cli/#attach) 실행중인 컨테이너에 접속한다.

source: * [`docker build`](http://docs.docker.io/en/latest/commandline/cli/#build) creates image from Dockerfile.
ko: * [`docker build`](http://docs.docker.io/en/latest/commandline/cli/#build) Dockerfile을 통해 이미지를 생성한다.

source: * [`docker commit`](http://docs.docker.io/en/latest/commandline/cli/#commit) creates image from a container.
ko: * [`docker commit`](http://docs.docker.io/en/latest/commandline/cli/#commit) 컨테이너에서 이미지를 생성한다.

source: * [`docker cp`](http://docs.docker.io/en/latest/commandline/cli/#cp) copies into a container.
ko: * [`docker cp`](http://docs.docker.io/en/latest/commandline/cli/#cp) 컨테이너 내의 파일을 호스트로 복사한다.

source: * [`docker diff`](http://docs.docker.io/en/latest/commandline/cli/#diff) shows changed files in the container's FS.
ko: * [`docker diff`](http://docs.docker.io/en/latest/commandline/cli/#diff) 컨테이너 파일 시스템에서 변경된 파일들을 보여준다.

source: * [`docker events`](http://docs.docker.io/en/latest/commandline/cli/#events) gets events from container.
ko: * [`docker events`](http://docs.docker.io/en/latest/commandline/cli/#events) 컨테이너로부터 이벤트를 가져온다.

source: * [`docker export`](http://docs.docker.io/en/latest/commandline/cli/#export) turns container fs into tarball.
ko: * [`docker export`](http://docs.docker.io/en/latest/commandline/cli/#export) 컨테이너 파일 시스템을 tarball로 출력한다.

source: * [`docker history`](http://docs.docker.io/en/latest/commandline/cli/#history) shows history of image.
ko: * [`docker history`](http://docs.docker.io/en/latest/commandline/cli/#history) 이미지의 이력 정보를 보여준다.

source: * [`docker images`](http://docs.docker.io/en/latest/commandline/cli/#images) shows all images.
ko: * [`docker images`](http://docs.docker.io/en/latest/commandline/cli/#images) 모든 이미지 목록을 보여준다.

source: * [`docker import`](http://docs.docker.io/en/latest/commandline/cli/#import) creates an image from a tarball.
ko: * [`docker import`](http://docs.docker.io/en/latest/commandline/cli/#import) tarball 파일로부터 이미지를 생성한다.

source: * [`docker insert`](http://docs.docker.io/en/latest/commandline/cli/#insert) inserts a file from URL into image.
ko: * [`docker insert`](http://docs.docker.io/en/latest/commandline/cli/#insert) URL에서 이미지로 파일을 집어넣는다.

source: * [`docker inspect`](http://docs.docker.io/en/latest/commandline/cli/#inspect) looks at all the info on a container (including IP address).
ko: * [`docker inspect`](http://docs.docker.io/en/latest/commandline/cli/#inspect) ip 주소를 포함한 특정 컨테이너에 대한 모든 정보를 보여준다.

source: * [`docker kill`](http://docs.docker.io/en/latest/commandline/cli/#kill) sends a SIGKILL to a container.
ko: * [`docker kill`](http://docs.docker.io/en/latest/commandline/cli/#kill) 컨테이너에게 SIGKILL을 보낸다.

source: * [`docker login`](http://docs.docker.io/en/latest/commandline/cli/#login) to login to a registry.
ko: * [`docker login`]() 레지스트리에 로그인한다.

source: * [`docker logs`](http://docs.docker.io/en/latest/commandline/cli/#logs) gets logs from container.
ko: * [`docker logs`](http://docs.docker.io/en/latest/commandline/cli/#logs) 컨테이너로부터 로그를 가져온다.

source: * [`docker port`](http://docs.docker.io/en/latest/commandline/cli/#port) shows public facing port of container.
ko: * [`docker port`](http://docs.docker.io/en/latest/commandline/cli/#port) 컨테이너의 특정 포트가 어디로 연결되어있는지 보여준다.

source: * [`docker ps`](http://docs.docker.io/en/latest/commandline/cli/#ps) shows running containers.
ko: * [`docker ps`](http://docs.docker.io/en/latest/commandline/cli/#ps) 명령어는 실행중인 컨테이너 목록을 보여준다.

source: * [`docker pull`](http://docs.docker.io/en/latest/commandline/cli/#pull) pulls an image from registry to local machine.
ko: * [`docker pull`](http://docs.docker.io/en/latest/commandline/cli/#pull) 이미지를 레지스트리에서 로컬 머신으로 가져온다(pull).

source: * [`docker push`](http://docs.docker.io/en/latest/commandline/cli/#push) pushes an image to the registry from local machine.
ko: * [`docker push`](http://docs.docker.io/en/latest/commandline/cli/#push) 이미지를 로컬 머신에서 레지스트리에 집어넣는다(push).

source: * [`docker restart`](http://docs.docker.io/en/latest/commandline/cli/#restart) restarts a container.
ko: * [`docker restart`](http://docs.docker.io/en/latest/commandline/cli/#restart) 컨테이너를 재가동한다.

source: * [`docker rm`](http://docs.docker.io/en/latest/commandline/cli/#rm) deletes a container.
ko: * [`docker rm`](http://docs.docker.io/en/latest/commandline/cli/#rm) 컨테이너를 삭제한다.

source: * [`docker rmi`](http://docs.docker.io/en/latest/commandline/cli/#rmi) removes an image.
ko: * [`docker rmi`](http://docs.docker.io/en/latest/commandline/cli/#rmi) 이미지를 삭제한다.

source: * [`docker run`](http://docs.docker.io/en/latest/commandline/cli/#run) creates a container.
ko: * [`docker run`](http://docs.docker.io/en/latest/commandline/cli/#run) 컨테이너를 생성한다.

source: * [`docker save`](http://docs.docker.io/en/latest/commandline/cli/#save) saves an image to a tar archive stream to STDOUT with all parent layers, tags & versions (as of 0.7).
ko: * [`docker save`](http://docs.docker.io/en/latest/commandline/cli/#save) 모든 부모 레이어와 태그, 버전 정보를 tar 형식으로 표준출력을 통해 @@@ (0.7부터 사용가능).

source: * [`docker search`](http://docs.docker.io/en/latest/commandline/cli/#search) searches registry for image.
ko: * [`docker search`](http://docs.docker.io/en/latest/commandline/cli/#search) 레지스트리에서 이미지를 검색한다.

source: * [`docker start`](http://docs.docker.io/en/latest/commandline/cli/#start) will start it again.
ko: * [`docker start`](http://docs.docker.io/en/latest/commandline/cli/#start) 컨테이너를 다시 실행시킨다.

source: * [`docker stop`](http://docs.docker.io/en/latest/commandline/cli/#stop) stops it.
ko: * [`docker stop`](http://docs.docker.io/en/latest/commandline/cli/#stop) 컨테이너를 정지시킨다.

source: * [`docker tag`](http://docs.docker.io/en/latest/commandline/cli/#tag) tags an image to a name (local or registry).
ko: * [`docker tag`](http://docs.docker.io/en/latest/commandline/cli/#tag) 이미지에 이름으로 태그를 붙여준다(local 혹은 registry).

source: * [`docker top`](http://docs.docker.io/en/latest/commandline/cli/#top) shows running processes in container.
ko: * [`docker top`](http://docs.docker.io/en/latest/commandline/cli/#top) 컨테이너에서 실행중인 프로세스를 보여준다.

source: * [`docker wait`](http://docs.docker.io/en/latest/commandline/cli/#wait) blocks until container stops.
ko: * [`docker wait`](http://docs.docker.io/en/latest/commandline/cli/#wait) 컨테이너가 멈출 때까지 블럭한다.

source: * __Containers are not limited to running a single command or process.__ You can use [supervisord](http://docs.docker.io/en/latest/examples/using_supervisord/) or [runit](https://github.com/phusion/baseimage-docker).
ko: * __컨테이너에서 오직 하나의 명령어나 커맨드만 실행시킨다는 것은 잘못된 생각이다.__ [supervisord](http://docs.docker.io/en/latest/examples/using_supervisord/)나 [runit](https://github.com/phusion/baseimage-docker)를 사용할 수 있다..

source: * __Containers are not transient__.
ko: * __컨테이너는 일시적으로 작동하지 않는다__.

source: > "Docker interests me because it allows simple environment isolation and repeatability.
ko: > "나에게 Docker의 매력은 간단히 격리된 환경을 만들 수 있다는 것과, 그러한 환경을 재사용할 수 있다는 점이다."

source: A registry is a *host* -- a server that stores repositories and provides an HTTP API for [managing the uploading and downloading of repositories](http://docs.docker.io/en/latest/use/workingwithrepository/).
ko: 레지스트리란 저장소를 저장해두고 HTTP API를 통해 [저장소의 업로드, 관리, 다운로드]()를 제공하는 호스트를 의미한다. @@@

source: A repository is a *hosted* collection of tagged images that together create the file system for a container.
ko: 저장소(repository)란 컨테이너를 위한 파일 시스템을 생성할 수 있는 호스트되는 태그가 붙어있는 이미지들의 집합.

source: And best of all, everything is fast and simple."
ko: 무엇보다도 이런 모든 일들이 빠르고 간단히 가능하다.

source: And you can connect to it that way.
ko: 이를 통해 연결할 수 있다.

source: Best to look at [http://github.com/wsargent/docker-devenv](http://github.com/wsargent/docker-devenv) and the [best practices](http://crosbymichael.com/dockerfile-best-practices.html) for more details.
ko: [http://github.com/wsargent/docker-devenv](http://github.com/wsargent/docker-devenv)를 추천한다. 더 자세한 내용은 [best practices](http://crosbymichael.com/dockerfile-best-practices.html) 이 글을 추천한다.

source: Containers are to Virtual Machines as threads are to processes.
ko: 컨테이너와 가상 머신 간의 관계는 쓰레드와 프로세스 간의 관계와 비슷하다.

source: Docker volumes are [free-floating filesystems](http://docs.docker.io/en/latest/use/working_with_volumes/).
ko: Docker의 볼륨은 [유동적인 파일시스템](http://docs.docker.io/en/latest/use/working_with_volumes/)이다.

source: Docker.io hosts its own [index](https://index.docker.io/) to a central registry which contains a large number of repositories.
ko: Docker.io는 매우 다양한 저장소를 포함하고 있는 이미지 [index]를 가지고 있는 중앙 레지스트리이다. @@@

source: Exposing ports through the host container is [fiddly but doable](http://docs.docker.io/en/latest/use/port_redirection/#binding-a-port-to-an-host-interface).
ko: 포트를 노출시키는 일은 [귀찮지만 유용하다](http://docs.docker.io/en/latest/use/port_redirection/#binding-a-port-to-an-host-interface).

source: First expose the port in your Dockerfile:
ko: 먼저 Dockerfile에서 포트를 노출시킨다.

source: For instance, if you need to have two docker instances communicate by leaving stuff on the filesystem.
ko: 예를 들어 두 Docker 인스턴스에서 파일 시스템으로부터 떨어져서 통신을 해야하는 경우가 있다.

source: Furthermore, everything that runs in that environment is isolated from the underlying host (much like a virtual machine).
ko: 또한 여기서 실행되는 모든 것은 마치 가상머신과 같이 호스트로부터 격리되어있다.

source: I can create a run-time environment once, package it up, then run it again on any other machine.
ko: 런타임 환경을 한 번 만들어 패키지로 만들면, 이 패키지를 다른 어떤 머신에서도 다시 사용할 수 있다.

source: If you forget what you mapped the port to on the host container, use `docker port` to show it:
ko: 만약 포트가 어디로 연결되었는지 기억이 안 난다면 `docker port` 명령어를 사용할 수 있다.

source: If you have a container with the name CONTAINER (specified by `docker run -name CONTAINER`) and in the Dockerfile, it has an exposed port:
ko: 예를 들어 CONTAINER이라는 이름을 가진 컨테이너가 있다고 하자(`docker run -name CONTAINER`). 이 컨테이너는 Dockerfile에서 port를 아래와 같이 노출시킨다.

source: If you want a transient container, `docker run -rm` will remove the container after it stops.
ko: 일시적인 컨테이너를 생성하고자 할 때는 `docker run -rm` 명렁어를 사용해 컨테이너를 생성할 수 있다. 이 컨테이너는 멈춰지면 삭제된다.

source: If you want to expose container ports through the host, see the [exposing ports](https://gist.github.com/wsargent/7049221#exposing-ports) section.
ko: 컨테이너의 포트를 호스트 쪽으로 열어 주고자 할 때는 [exposing ports](https://gist.github.com/wsargent/7049221#exposing-ports)을 참조하면 된다.

source: If you want to integrate a container with a [host process manager](http://docs.docker.io/en/latest/use/host_integration/), start the daemon with `-r=false` then use `docker start -a`.
ko: 컨테이너를 [host process manager](http://docs.docker.io/en/latest/use/host_integration/)와 통합하고자 할 때는 Dockre 데몬을`-r=false` 옵션으로 실행시키고 `docker start -a` 명령어를 실행하면 된다.

source: If you want to map a directory on the host to a docker container, `docker run -v $HOSTDIR:$DOCKERDIR` (also see Volumes section).
ko: 호스트의 디렉토리와 Docker 컨테이너 디렉토리를 맵핑하고자 할 때는 `docker run -v $HOSTDIR:$DOCKERDIR` 명령어를 사용할 수 있다(also see Volumes section).

source: If you want to poke around in an image, `docker run -t -i <myshell>` to open a tty.
ko: 이미지 안을 뒤질 필요가 있을 때는 `docker run -t -i <myshell>` 명령어로 tty를 열 수 있다.

source: If you want to run and then interact with a container, `docker start` then `docker attach` to get in.
ko: 컨테이너를 실행하고 컨테이너에 접속하고자 할 때는 `docker start` 명령어를 실행하고 `docker attach` 명령어를 실행한다.

source: If you're running Docker in Virtualbox, you then need to forward the port there as well.
ko: Docker가 가상 머신에서 실행중이라면 추가적인 포트포워딩을 해줘야한다.

source: Images are just [templates for docker containers](http://docker.readthedocs.org/en/latest/terms/image/).
ko: 이미지는 그저 [Docker 컨테이너의 템플릿](http://docker.readthedocs.org/en/latest/terms/image/)이다.

source: In the VM:
ko: 가상 머신 내부에서:

source: Install VirtualBox and Vagrant using [Brew Cask](https://github.com/phinze/homebrew-cask).
ko: [Brew Cask](https://github.com/phinze/homebrew-cask)를 사용해 VirtualBox와 Vagrant 설치.

source: It can be useful to define something in Vagrantfile to expose a range of ports so that you can dynamically map them:
ko: 이러한 설정을 할 때는 Vagrantfile을 통해서 특정 범위의 포트를 노출시켜 동적으로 맵핑하는 게 편리하다.

source: Links are how Docker containers talk to each other [through TCP/IP ports](http://docs.docker.io/en/latest/use/working_with_links_names/).
ko: Docker 컨테이너들이 [TCP/IP ports](http://docs.docker.io/en/latest/use/working_with_links_names/)으로 링크를 통해 서로 정보를 주고받는다..

source: NOTE: If you want containers to ONLY communicate with each other through links, start the docker daemon with `-icc=false` to disable inter process communication.
ko: 참고 : 만약 컨테이너들 간에 오직 링크를 통해서만 통신을 허용하고 싶다면 Docker 데몬을 실행할 때 `icc=false` 옵션을 통해 프로세스간 통신을 막을 수 있다.

source: Or you can think of them as chroots on steroids.
ko: 아니면 스테로이드 주사를 맞은 chroot라고도 생각할 수 있다.

source: See [advanced volumes](http://crosbymichael.com/advanced-docker-volumes.html) for more details.
ko: 더 자세한 사항은 [advanced volumes](http://crosbymichael.com/advanced-docker-volumes.html) 페이지를 참고해주세요.

source: See [bug](https://github.com/dotcloud/docker/issues/1141).
ko: [bug](https://github.com/dotcloud/docker/issues/1141) 참조.

source: Sets up a Docker container when you run `docker build` on it.
ko: `docker build` 명령어를 통해서 Docker 컨테이너를 만들어낸다.

source: Some common misconceptions it's worth correcting:
ko: 몇 가지 오해가 있다면:

source: Sources:
ko: 참고:

source: That's it, you have a running Docker container.
ko: 설치는 이게 전부다. 마지막 명령어를 통해 Docker 컨테이너 하나가 실행되었다.

source: The [versioned filesystem](http://en.wikipedia.org/wiki/Aufs) in Docker is based on layers.
ko: Docker에서 [버전화된 파일 시스템은](http://en.wikipedia.org/wiki/Aufs) 레이어에 기반하고 있다..

source: Then if we create another container called LINKED like so:
ko: 그리고 다음과 같이 LINKED라고 이름붙여진 또 다른 컨테이너를 만든다.

source: Then map the container port to the host port:
ko: 그리고 `docker run` 명령어를 통해서 컨테이너의 포트와 호스트의 포트를 맵핑시킨다.

source: Then the exposed ports and aliases of CONTAINER will show up in LINKED with the following environment variables:
ko: 노출된 포트와 CONTAINER의 별칭이 아래와 같이 LINKED 컨테이너의 환경변수로 나타난다:

source: They don't have to be connected to a particular container.
ko: 볼륨은 특정 컨테이너에 연결되어있지 않아도 된다.

source: They're like [git commits or changesets for filesystems](http://docker.readthedocs.org/en/latest/terms/layer/).
ko: 이는 [파일 시스템을 위한 git commits나 차분](http://docker.readthedocs.org/en/latest/terms/layer/)이라고 생각할 수 있다.

source: To delete links, use `docker rm -link `.
ko: 이 링크를 삭제하려면 `docker rm -link` 명령어를 사용하면 된다.

source: Use [Homebrew](http://brew.sh/).
ko: [Homebrew](http://brew.sh/) 설치.

source: Vastly preferable to `docker commit`.
ko: 또한 `docker commit` 명령어보다 추천되는 명령어이다.

source: Verify:
ko: 제대로 작동하는 지 확인:

source: Volumes are useful in situations where you can't use links (which are TCP/IP only).
ko: 볼륨은 TCP/IP를 통한 링크가 사용가능한 환경에서 유용하다.

source: We use the pre-built vagrant box: [http://blog.phusion.nl/2013/11/08/docker-friendly-vagrant-boxes/](http://blog.phusion.nl/2013/11/08/docker-friendly-vagrant-boxes/)
ko: 여기서는 미리 준비한 vagrant 박스를 사용한다: [http://blog.phusion.nl/2013/11/08/docker-friendly-vagrant-boxes/](http://blog.phusion.nl/2013/11/08/docker-friendly-vagrant-boxes/)

source: You can mount them in several docker containers at once, using `docker run -volume-from`
ko: 먼저 이것들을 docker 컨테이너에 동시에 마운트 하고 `docker run -volume-from` 명령어를 실행합니다.

source: [Has issues](https://github.com/dotcloud/docker/issues/197).
ko: [이에 관련된 이슈가 있다.](https://github.com/dotcloud/docker/issues/197).

source: [Linking into Redis](http://docs.docker.io/en/latest/examples/linking_into_redis/) and [Atlassian](http://blogs.atlassian.com/2013/11/docker-all-the-things-at-atlassian-automation-and-wiring/) show worked examples.
ko: [Redis로 링크 걸기](http://docs.docker.io/en/latest/examples/linking_into_redis/) and [Atlassian](http://blogs.atlassian.com/2013/11/docker-all-the-things-at-atlassian-automation-and-wiring/)에서는 어떻게 작동되는지 예제를 보여준다.

source: [The configuration file](http://docs.docker.io/en/latest/use/builder/#dockerbuilder).
ko: [Docker 설정 파일](http://docs.docker.io/en/latest/use/builder/#dockerbuilder).

source: ``` docker inspect `dl` | grep IPAddress | cut -d '"' -f 4 ```
ko: ``` docker run -i -t ubuntu /bin/bash ```

source: `docker import` and `docker commit` only set up the filesystem, not Dockerfile info like CMD or ENTRYPOINT or EXPOSE.
ko: `docker import`와 `docker commit` 파일 시스템만 셋업하고 Dockefile과 같은 CMD, ENTRYPOINT, EXPOSE는 포함하지 않는다..

source: `docker ps -a` shows running and stopped containers.
ko: `docker ps -a` 실행중인 컨테이너와 멈춰있는 컨테이너를 모두 보여준다.

source: `docker run` doesn't do what you think.
ko: `docker run`은 당신이 얼핏 예상하는 그런 식으로 작동하지 않는다.

source: or
ko: 명령어를 사용하거나 아래 명령어를 사용합니다.
